SusieSmith_Task3-Titanic.ipynb

Susie Smith

February 14, 2023

Task 3 - Titanic

9.12.3 Reading the Titanic Disaster Dataset

#1-Load: Use pandas to read in the Titanic Disaster dataset csv file.

In [27]:
import pandas as pd

In [28]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

#2-View: Set the precision to 2 decimal places. View the head and the tail of the file.

In [29]:
pd.set_option('display.precision',2)

In [30]:
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [31]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

#3-Headings: Customize column headings

In [32]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

In [33]:
titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

9.12.4 Simple Data Analysis with the Titanic Disaster Dataset

#4-Describe: Use the DataFrame describe() function to calculate basic descriptive statistics for all numeric columns.

In [34]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

#5-Survivors: Follow instructions to describe statistics for those who survived.

In [35]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

9.12.5 Passenger Age Histogram

In [36]:
%matplotlib

Using matplotlib backend: TkAgg

#6-Histogram: Use the DataFrame's hist() function to create a histogram for each numerical column.

In [37]:
histogram = titanic.hist()